# 2.数据类型-String

Redis 字符串存储字节序列，包括文本、数字、序列化对象（JSON字符串）和二进制数组（位图、图像、音频、视频）。因此，字符串是可以与 Redis 键关联的最简单的值类型。它们通常用于缓存，但它们支持其他功能，使你能够实现计数器并执行按位操作。

业务场景：

1. 缓存：将数据库中的热点数据或查询结果缓存到 Redis 中，以减轻数据库的压力，提高数据访问速度。
2. 会话管理：在分布式系统中，可以使用 Redis 存储用户的会话信息，实现会话共享。
3. 计数器：虽然 Redis 提供了专门的命令（如 INCR、DECR）来处理整数的增减操作，但你也可以通过字符串操作（如 GET、SET）来实现更复杂的计数逻辑。
4. 分布式锁：利用 Redis 的 String 类型和原子操作（如 SETNX）来实现分布式锁，控制多个进程或线程对共享资源的访问。
5. 配置管理：将应用的配置信息存储在 Redis 中，方便动态修改和读取，无需重启应用。
6. 消息队列：虽然 Redis 提供了专门的列表（List）、发布/订阅（Pub/Sub）等类型来实现消息队列的功能，但在某些简单的场景下，你也可以使用 String 类型来模拟消息队列。
7. 用户身份认证：存储用户的 Token 或其他身份认证信息，用于 API 的访问控制。

## 基础语法

`SET key value`

如果key已经存在，那么将替换已经存储在key中的value。

> 注意：默认情况下，单个 Redis 字符串的最大为 512 MB。

```bash
> SET bike:1 Deimos
OK
> GET bike:1
"Deimos"
```

```python
from connect import r

if __name__ == '__main__':
    res1 = r.set('bike:1', 'Deimos')
    print(res1)  # True
    res2 = r.get('bike:1')
    print(res2)  # 'Deimos'
```

### SET命令还有一些附加选项

比如：
nx - 如果key已经存在，则会失败
xx - 只有当key已经存在，才会成功

```bash
> set bike:1 bike nx
(nil)
> set bike:1 bike xx
OK
```

```python
res3 = r.set("bike:1", "bike", nx=True)
print(res3)  # None
print(r.get("bike:1"))  # Deimos
res4 = r.set("bike:1", "bike", xx=True)
print(res4)  # True
```

### 一次性设置或返回多个key的值

```bash
> mset bike:1 "Deimos" bike:2 "Ares" bike:3 "Vanth"
OK
> mget bike:1 bike:2 bike:3
1) "Deimos"
2) "Ares"
3) "Vanth"
```

```python
res5 = r.mset({"bike:1": "Deimos", "bike:2": "Ares", "bike:3": "Vanth"})
print(res5)  # True
res6 = r.mget(["bike:1", "bike:2", "bike:3"])
print(res6)  # ['Deimos', 'Ares', 'Vanth']
```

### 将字符串作为计数器

INCR 命令将字符串值解析为整数，将其递增 1，最后将获得的值设置为新值

还有其他类似的命令，如 INCRBY 、 DECR 和 DECRBY 。在内部，它始终是相同的命令，但作用方式略有不同。

INCR是原子性的是什么意思？即使多个客户端针对同一密钥发出 INCR，也永远不会进入争用条件。

即多个客户端同时对一个键执行INCR操作时，不会出现数据冲突或不一致的情况。每个客户端都会得到正确的自增结果，而不会受到其他客户端操作的影响。

INCR命令的原子性特性使其在高并发场景下具有广泛的应用，如：

1. 计数器：用于实现各种计数器功能，如网站访问量统计、API调用次数限制等。
2. 分布式锁：结合Redis的其他命令和机制，可以实现分布式锁的功能，用于控制多个进程或线程对共享资源的访问。
3. 限流：在需要限制请求速率的场景中，可以使用INCR命令结合Redis的过期时间设置来实现限流功能。

```bash
> set total_crashes 0
OK
> incr total_crashes
(integer) 1
> incrby total_crashes 10
(integer) 11
```

```python
r.set("total_crashes", 0)
res7 = r.incr("total_crashes")
print(res7)  # 1
res8 = r.incrby("total_crashes", 10)
print(res8)  # 11
```

